[{
    "userId": 1,
    "id": 1,
    "title": "Vantik Creative",
    "body1": "This is a website I designed and created for a digital product studio called Vantik. (Unfortunately they are no longer operating as a business 😥.) I designed all assets and coded the website.",
    "subtitle1": "",
    "desc1": "",
    "image1": "/images/projects/vantik/desktop.jpg",
    "subtitle2": "",
    "desc2": "",
    "image2": "/images/projects/vantik/tablet.jpg",
    "subtitle3": "",
    "desc3": "",
    "image3": "/images/projects/vantik/phone.jpg",
    "projectLink": "https://vantik-creative-sample.netlify.com/"
  },
  {
    "userId": 2,
    "id": 2,
    "title": "Yusō",
    "body1": "This is a website that I designed and created for a digital product called Yusō. I designed all assets and coded the website.",
    "subtitle1": "",
    "desc1": "",
    "image1": "/images/projects/yuso/desktop.jpg",
    "subtitle2": "",
    "desc2": "",
    "image2": "/images/projects/yuso/mobile.jpg",
    "subtitle3": "",
    "desc3": "",
    "image3": "/images/projects/yuso/tablet.jpg",
    "projectLink": "http://goyuso.com/"
  },
  {
    "userId": 3,
    "id": 3,
    "title": "HelloMoto VR",
    "body1": "I designed this vr experience while working at Onefire, as their Lead Product Designer. It is a Google Daydream app that Motorola used to generate interest in their Moto Z2 force back when it came out (2017). HelloMoto vr is a single app consisting of 3 separate experiences that highlight the phone’s unique features. My role on the project was a cross functional project manager and design role.",
    "body2": "I worked closely with motorola, handling most communication, from vision and project planning to delivery of the app. I was also making executive creative decisions, overseeing our in house unity developer, and the contracted 3D artist and music composer. I also directly worked on the ui/ux of experience as well.",
    "subtitle1": "Soundboost Blast",
    "desc1": "In this game, players find themselves at a campsite with the JBL SoundBoost 2 speaker mod. They are invited to play a game similar to ‘Guitar Hero’. The game creatively conveys the mod’s 10-hour built-in battery by starting at night and ending at sunrise. Soundboost Blast illustrates the other features of JBL speaker as well, while giving players a memorable experience with custom music and appealing visual effects.",
    "image1": "/images/projects/motovr/soundboost.jpg",
    "subtitle2": "Projector Power",
    "desc2": "Projector Power is a game that demonstrates the moto insta-share projector mod. Players point the projector mod towards an airplane that is circling the inside of a circus tent (slightly above the player’s head). Players are instructed to keep the projector on the plane, which helps the plane pick up speed. In short, if the player cannot keep the projector pointed at the plane, it slows down. Balloons serve as obstacles, keeping players alert and further increasing the game’s difficulty.",
    "image2": "/images/projects/motovr/power.jpg",
    "subtitle3": "Interactive Showcase",
    "desc3": "In the showcase, users find themselves able to interact with the moto z2 force and various moto mods. The user can attach and detach the various moto mods, causing the environment to shift to other immersive scenes - like a canyon, for example. When each mod is applied, users are served up an informative video, while features get highlighted on the virtual device. This experience was purely informative, and not gamify. It’s still fun to interact with the device though.",
    "image3": "/images/projects/motovr/showcase.jpg",
    "projectLink": "https://play.google.com/store/apps/details?id=com.motorolatraining.hellomotovr"
  },
  {
    "userId": 4,
    "id": 4,
    "title": "VR Arcade",
    "body1": "I designed this experience while working at Onefire, as a ui/ux contractor. It is a virtual reality arcade that the Abbey Resort, in Michigan, wanted as a way to create some new appeal to their resort. In short, the arcade is a self-running arcade machine utilizing an iPad pro for user input, and an HTC Vive for virtual reality gaming.",
    "body2": "Our team had a public event and invited interns working at various companies across the Peoria IL area to come play test our project. There we about 30 eager play testers to observe and interview, giving me lots of insight on how to improve the ux for beta and production versions of the arcade. I also worked closely with the iOS developer to create the animations and interesting visual effects in the ui.",
    "subtitle1": "Immersion Arcade",
    "desc1": "Immersion arcade is the name and brand of the entertainment area at the resort. The client developed the branding and logo, and I worked with it to create an edgy, but easily accessible interface.",
    "image1": "/images/projects/vrarcade/welcome.jpg",
    "subtitle2": "The User Experience",
    "desc2": "A resort supervisor mans each vr arcade, and when a guest wants to use a machine they simply approach the resort supervisor, who then enters a passcode and time that the guest pays for. The guest can then select games by swiping on the iPad. When they pick a game, they can put on the vr headset and start playing. They can pause at any moment and select a new game as well. The arcade is completely self-service though. The resort simply supervises the arcades because the vr stations are very expensive.",
    "image2": "/images/projects/vrarcade/experience.jpg",
    "subtitle3": "Design Decisions",
    "desc3": "The design accommodates for an abundance of games, so new ones can be easily added in the future and features large touch areas, so players can easily pause, switch, and resume playing with ease.",
    "image3": "/images/projects/vrarcade/games.jpg",
    "projectLink": "https://www.theabbeyresort.com/things-to-in-lake-geneva/abbey-resort-activities/immersion_experience/"
  },
  {
    "userId": 5,
    "id": 5,
    "title": "IL School Viz",
    "body1": "This is a geographical data visualization of Illinois’ public school data for the year 2016. I designed and developed this visualization tool, while working alongside a data scientist who collected and organized the data for me.",
    "subtitle1": "Curiosity",
    "desc1": "This project stemmed from curiosity about Illinois’ public school data. The goal of this project is to simply visualize data that was collected by the Illinois State Board of Education (ISBE) and see how the data varies across geographic area. This was not a client project, just a project used to help curious people interested in such data.",
    "image1": "/images/projects/ildataviz/welcome.jpg",
    "subtitle2": "Understanding the Data",
    "desc2": "The data used in this project is publicly accessible on multiple websites, but by adding a simple and intuitive interface people can now read, understand, and share the data.",
    "image2": "/images/projects/ildataviz/desktop.jpg",
    "subtitle3": "Lots of Data",
    "desc3": "The project is accessible on any device and offers lots of insights into Illinois' public school data that teachers, parents, and more would find interesting.",
    "image3": "/images/projects/ildataviz/tablets.jpg",
    "projectLink": "https://thecuriousoutlier.github.io/"
  },
  {
    "userId": 6,
    "id": 6,
    "title": "NASA - MOCsat",
    "body1": "MOCsat is a mobile app that a team and I worked on as a senior project in college. It is a mission operations control (MOC) app for NASA and NASA funded satellite missions conducted at Universities across the US. I played a cross functional lead role as a front-end developer, and ui/ux designer for this app.",
    "body2": "Most of my time was spent on ux research and its implementation into the ui. I led the research team, and worked closely with the development team to implement the ui, features, and fix bugs in the code. I mainly focused on front-end development when it came to my developer responsibilities.",
    "subtitle1": "Project Goal",
    "desc1": "The problem our team was trying to solve was that scientists, professors, students, and engineers have to constantly be supervising mission control rooms at universities that conduct satellite missions. In short, universities that are conducting satellite missions, and have control stations on campus, have only one way of getting data about their mission. They must be at the control station, in person, looking at the satellite connect computers. The goal of the MOCsat was to give the those responsible for these control stations, the ability to take their satellite feeds on the go, with real-time data and push notification wrapped into a helpful a mobile app.",
    "image1": "/images/projects/mocsat/dashboard.jpg",
    "subtitle2": "Building Progressive Web Apps for Native",
    "desc2": "Before we started working we considered our technical limitations with this project. We knew it needed to be mobile friendly, utilizing many native phone features like push notifications. So we cut out the possibility of doing just a responsive web app. However, we would not finish the project in our 4 month time frame if we had to build 2 mobile apps, for iOS and Android. That’s why we decided to use the Ionic Framework. It allowed us to cut down on development time because there was one code base, it gave us the ability to leverage native phone features, plus most of the team already knew javascript. By cutting back on development time, we were also able to allow more time for ux research.",
    "image2": "/images/projects/mocsat/iphone.jpg",
    "subtitle3": "User Centered Design",
    "desc3": "The ui/ux of this app was all intentional and derived from weeks of user research, and prototyping. After weeks of creating mockups, paper prototypes, conducting interviews, and iterating our design phase and feedback phase we were able to implement powerful features and leverage mobile affordances that made our end-users very happy. Everything from how to configure dashboards for missions, to the sizes of the font. Anything that once kept a space engineer, scientist, or student tied down to a control stations can now be accessed anywhere, from their mobile device through a meaningful and helpful interface.",
    "image3": "/images/projects/mocsat/comp1.jpg",
    "projectLink": ""
  },
  {
    "userId": 7,
    "id": 7,
    "title": "Ignite Survey",
    "body1": "This was a project that I worked on while interning at a startup called Northerly back in college (unfortunately Northerly is no longer operating as a business 😥). The team and I were tasked with creating a fun and engaging, but quick and easy, survey for an annual art and tech festival in Peoria IL.",
    "body2": "My role on the project was overall design and development of the survey. The project was built with vanilla JavaScript, HTML, SCSS, Processing, and Firebase which was being watched by a Node server that we used for the collaborative data viz part of the project.",
    "subtitle1": "Intuitive UI",
    "desc1": "Since anyone and everyone could be taking this survey, I designed it with a large audience in mind. I made the inputs and text easy to read, and the experience seamless and intuitive for people using it on mobile devices.",
    "image1": "/images/projects/ignite/welcome.jpg",
    "subtitle2": "Survey Design",
    "desc2": "The questions in the survey were designed to be easy and fast to answer, without seeming intrusive in anyway. The goal was to craft the experience in a way where the guests could take the survey without giving it much thought, or feeling like they have to give their answers much thought. In short, we wanted the participants to feel like the survey was another exhibit at the event.",
    "image2": "/images/projects/ignite/survey.jpg",
    "subtitle3": "Collaborative Data Visualization",
    "desc3": "As guests answered questions, the survey was generating a unique visualization that changed based off of their answers, and time of submission. Once they completed the survey, our little node server would notice any new addition to the firebase database, and a printer would print out the Processing sketch of the visitor’s unique visualization, in a fully automated process. Visitor could then take and post their visual on to a wall with others’ results to take part in a collaborative data visualization experiment.",
    "image3": "",
    "videoLink": "https://fast.wistia.com/embed/medias/kvdrb93p6n/swatch",
    "projectLink": ""
  },
    {
    "userId": 8,
    "id": 8,
    "title": "#codevember",
    "body1": "Codevember is a month long challenge my friends and I created where developers of all skill levels can participate in hopes of building software professional communities in areas where there might not be one. The goal is to write code, and work on one project related to the annual theme over the course of November. Participants can join the slack community to share updates on their progress, help each other, and participate in the growing community overall. At the end of the month, participants submit their code to a github repo to share their work, and everyone hops in a online meetup where we talk about and share the work.",
    "body2": "I branded, designed, and built the website for the event. I continue to help plan for the coming years as well.",
    "subtitle1": "",
    "desc1": "",
    "image1": "/images/projects/codevember/mobile.jpg",
    "subtitle2": "",
    "desc2": "",
    "image2": "/images/projects/codevember/tablet.jpg",
    "subtitle3": "",
    "desc3": "",
    "image3": "/images/projects/codevember/laptop.jpg",
    "projectLink": "https://codevember.co/"
  }
]
