[
  {
    "userId": 1,
    "id": 1,
    "title": "Vantik Creative",
    "body": "This is a website I designed and created for a company called Vantik. I designed all assets and coded the website.",
    "subtitle1": "",
    "desc1": "",
    "image1": "/images/projects/vantik/desktop.jpg",
    "subtitle2": "",
    "desc2": "",
    "image2": "/images/projects/vantik/tablet.jpg",
    "subtitle3": "",
    "desc3": "",
    "image3": "/images/projects/vantik/phone.jpg",
    "projectLink": "http://www.vantikcreative.com/"
  },
  {
    "userId": 2,
    "id": 2,
    "title": "Yusō",
    "body": "This is a website that I designed and created for a company called Yusō. I designed all assets and coded the website.",
    "subtitle1": "",
    "desc1": "",
    "image1": "/images/projects/yuso/desktop.jpg",
    "subtitle2": "",
    "desc2": "",
    "image2": "/images/projects/yuso/mobile.jpg",
    "subtitle3": "",
    "desc3": "",
    "image3": "/images/projects/yuso/tablet.jpg",
    "projectLink": "http://goyuso.com/"
  },
  {
    "userId": 3,
    "id": 3,
    "title": "HelloMoto VR",
    "body": "I designed this VR experience while working at Onefire, as Lead Product Designer. It is a Google Daydream app that Motorola used to generate hype about the Moto Z2 force when it came out in 2017. HelloMoto VR is a single app consisting of 3 experiences that highlight the phone's features. My role in the project was to make executive creative decisions, design and layout the user experience for the developers and 3D artist, design UI assets, design of app icons and marketing assets, enforce deadlines, and handle communication and delivery with the client.",
    "subtitle1": "Soundboost Blast",
    "desc1": "In this game, players find themselves at a campsite with the JBL SoundBoost 2 speaker mod. They are invited to play a game similar to ‘Guitar Hero’. The game creatively conveys the mod’s 10-hour built-in battery by starting at night and ending at sunrise. Soundboost Blast illustrates this impressive battery life, while giving players the chance to test their timing skills in a memorable game.",
    "image1": "/images/projects/motovr/soundboost.jpg",
    "subtitle2": "Projector Power",
    "desc2": "Projector Power is a game that demonstrates the moto insta-share projector mod. Players point the projector mod towards an airplane that is circling the inside of a circus tent. Players are instructed to keep the projector on the plane, which helps the plane pick up speed. If the player cannot keep the projector pointed at the plane, it slows down. Balloons serve as obstacles, keeping players alert and further increasing the difficulty.",
    "image2": "/images/projects/motovr/power.jpg",
    "subtitle3": "Interactive Showcase",
    "desc3": "In the showcase, users find themselves able to interact with the moto z2 force and various moto mods. The user can attach and detach the various moto mods, causing the environment to shift to other immersive scenes - like a canyon, for example. When each mod is applied, users are served up an informative video, while features get highlighted on the virtual device.",
    "image3": "/images/projects/motovr/showcase.jpg",
    "projectLink": "https://play.google.com/store/apps/details?id=com.motorolatraining.hellomotovr"
  },
  {
    "userId": 4,
    "id": 4,
    "title": "VR Arcade",
    "body": "I designed this experience while working at Onefire, as UI/UX contractor. It is a virtual reality arcade that the Abbey Resort, in Michigan, wanted as a way to create some new appeal to their resort. In short, the arcade is a self running arcade machine utilizing an iPad pro for user input, and an HTC Vive for virtual gaming.",
    "subtitle1": "Immersion Arcade",
    "desc1": "Immersion arcade is the name and brand of the entertainment area at the resort. The client developed the branding and logo, and I worked with it.",
    "image1": "/images/projects/vrarcade/welcome.jpg",
    "subtitle2": "The User Experience",
    "desc2": "A resort supervisor mans each VR arcade, and when a guest wants to use a machine they simply approach the resort supervisor, who then enters a passcode and time that the guest pays for. The guest can then select games by swiping on the iPad. When they pick a game, they can put on the VR headset and start playing. They can pause at any moment and select a new game as well.",
    "image2": "/images/projects/vrarcade/experience.jpg",
    "subtitle3": "Design Decisions",
    "desc3": "The design accommodates for an abundance of games, so new ones can be easily added in the future, and features large touch areas so user can easily pause, switch, and resume playing with ease.",
    "image3": "/images/projects/vrarcade/games.jpg",
    "projectLink": "https://www.theabbeyresort.com/immersion.aspx"
  },
  {
    "userId": 5,
    "id": 5,
    "title": "TADA!",
    "body": "TADA! is a data visualization platform, that I am currently designing/redesigning as TADA’s lead UI/UX Designer. My role in the project is to completely rethink and design TADA’s product. I also help out on front-end development as well.",
    "subtitle1": "The Power of TADA!",
    "desc1": "Some description 1.",
    "image1": "/images/projects/tadamobile/test1.jpg",
    "subtitle2": "The Light & Dark Side",
    "desc2": "Some description 2.",
    "image2": "/images/projects/tadamobile/test2.jpg",
    "subtitle3": "Device Accessibility",
    "desc3": "Some description 3.",
    "image3": "/images/projects/tadamobile/test3.jpg",
    "projectLink": "http://tada.today/"
  },
  {
    "userId": 6,
    "id": 6,
    "title": "IL School Viz",
    "body": "This is a geographical data visualization of Illinois public school data for the year 2016. I designed and developed the visualization tool, while working with a data scientist to collect and organize the data.",
    "subtitle1": "Curiosity",
    "desc1": "This project stemmed from curiosity about Illinois public school data. The goal of this project is to simply visualize data that was collected by the Illinois State Board of Education (ISBE) and see how the data varies across geographic area.",
    "image1": "/images/projects/ildataviz/welcome.jpg",
    "subtitle2": "Understanding the Data",
    "desc2": "The data used in this project is publically accessible on multiple websites, but by adding a simple and intuitive interface people can now read , understand, and share the data.",
    "image2": "/images/projects/ildataviz/desktop.jpg",
    "subtitle3": "Lots of Data",
    "desc3": "The project is accessible on any device, and offers lots of incites into Illinois' public school data that teachers, parents, and more would find interesting.",
    "image3": "/images/projects/ildataviz/tablets.jpg",
    "projectLink": "https://thecuriousoutlier.github.io/"
  },
  {
    "userId": 7,
    "id": 7,
    "title": "MOCsat",
    "body": "MOCsat is a mobile app that I designed and worked with a team to develop back in college. It is a mission operations control app for NASA and NASA funded satellite mission operation control (moc) stations at Universities across the US. I played a cross functional lead role as a front-end web developer, and UI/UX designer for this app.",
    "subtitle1": "Project Goal",
    "desc1": "The goal of this project was to make it so scientist’s, professors, students, and engineers could get important information from satellites and experiments at their finger tips, as opposed to having to be in the moc station 24/7. So after hours of research, testing, and prototyping we crafted the perfect experience for our users.",
    "image1": "/images/projects/mocsat/dashboard.jpg",
    "subtitle2": "Navtive Experience (From a PWA)",
    "desc2": "MOCsat is available on both Android and IOS. It was made using the Ionic Framework. We decided to use Ionic because we needed native features, like push notifications, on both IOS and android devices, and we needed all of this in just about 4 months’ time. By using ionic we were able to cut down on dev time, thus giving us just as much time for ux research and ui implementation.",
    "image2": "/images/projects/mocsat/iphone.jpg",
    "subtitle3": "User Centered Design",
    "desc3": "The ui/ux of this app was all intentional and derived from user research, and prototyping. After hours of interviews we were able to implement features and leverage mobile affordances that made our user very happy. Everything from configurable dashboards, to data tables, everything that keeps an engineer, scientist, or student tied down to a control stations can now be accessed anywhere, from a mobile device.",
    "image3": "/images/projects/mocsat/comp1.jpg",
    "projectLink": ""
  },
  {
    "userId": 8,
    "id": 8,
    "title": "Ignite Survey",
    "body": "This was a project that I worked on while interning at a startup called Northerly back in college (unfortunately Northerly is no longer in business 😥). The team and I were tasked with creating a fun and engaging, but quick and easy, survey for an annual art and tech festival in Peoria IL. My role on the project was overall design and front-end development. The project was built with vanilla Javascript and HTML, SCSS, Processing, and Firebase which was being watched by a Node server that we used for the collaborative data viz part of the project.",
    "subtitle1": "Intuitive UI",
    "desc1": "Anyone and everyone could be taking this survey and so I it designed with a large audience in mind. I made the inputs and text easy to read for a diverse audience, and the experience seamless and intuitive for the users.",
    "image1": "/images/projects/ignite/welcome.jpg",
    "subtitle2": "Survey Design",
    "desc2": "The questions in the survey were designed to be easy and fast to answer, without seeming intrusive so that visitors could take the survey without giving it much thought.",
    "image2": "/images/projects/ignite/survey.jpg",
    "subtitle3": "Collaborative Data Visualization",
    "desc3": "As guests answered questions, the survey was generating a unique visualization that changed based off of their answers, and time of submission. Once they complete the survey, our little node server would notice any new addition to the firebase database, and a printer would print out the Processing sketch of the visitors unique visualization. That visitor could then take and post it to a wall with others’ results to take part in a collaborative data visualization.",
    "image3": "",
    "videoLink": "https://fast.wistia.com/embed/medias/kvdrb93p6n/swatch",
    "projectLink": ""
  }
]
